{
  "Bongo Mata": "Bangamata as named by the nation of Bangalees to Sheikh Fojilatunnesa Mujib wife of Bangabandhu Sheikh Mujibar Rahman, Father of the nation of Bangladesh was born on 08 August 1930 in the Village Tungipara of Gopalgong District. She has played a vital role in providing inspiration, enthusiasm and courage in all activities of Bangabandhu during his life time. She has contributed in every step of the independence of Bangladesh. She sent her two brave sons in the liberation war for the independence of the motherland. She sacrificed her life along with Bangabandhu and other family members on the black day of the history of Bangladesh, 15 August 1975.",
  "Hi": "Hello",
  "How many faculty": "There are five faculty in bsfmstu including Faculty of Engineering, Faculty of Science, Faculty of Agriculture & Life Science, Faculty of Business, Faculty of Social Science.",
  "How many student hall": "There are two students hall one for female and one for male. Male hall name is Mirza Azam Hall which has about 150 seats and Nurunnahar Begum Hall which has 148 seats.",
  "Mirza Azam": "Mirza Azam is a Bangladeshi politician and Organizing Secretary of Bangladesh Awami League . He has been elected Member of Parliament (Bangladesh) six times and has served as State Minister for Textiles and Jute.With the heartiest effort of eminent education endeavour Mirza Azam MP and as a part of the implementation of the commitments of Honorable Prime Minister Sheikh Hasina and according to her direction, an initiation has been taken to establish a specialized university in Jamalpur District. As a result, Bangamata Sheikh Fojilatunnesa Mujib Science and Technology University is established",
  "Sheikh Hasina": "Sheikh Hasina, Honourable Prime Minister of Government of the People’s Republic of Bangladesh, assumed the office on 07 January 2019 for the fourth time after her party Awami League-led grand alliance won the December 30, 2018 11th Parliamentary elections. She has overseen a period of economic growth and development in Bangladesh. She has also worked to improve education and healthcare in the country. She is a strong advocate for women's rights and has implemented a number of programs to empower women.",
  "Sheikh Mujibur Rahman": "The \"Father of the Nation\" in Bangladesh is Sheikh Mujibur Rahman, often affectionately referred to as \"Bangabandhu\" (which means \"Friend of Bengal\"). He played a pivotal role in the country's struggle for independence and is widely recognized as the founding leader of Bangladesh. Sheikh Mujibur Rahman served as the first President of Bangladesh and later as its Prime Minister. His leadership and vision were instrumental in the nation's emergence as an independent and sovereign state in 1971 following the Bangladesh Liberation War. Bangabandhu's contributions to the nation and his legacy continue to hold great significance in Bangladesh's history and politics.",
  "Tell me about BSFMSTU": "Bangamata Sheikh Fojilatunnesa Mujib Science & Technology University is a government financed public university of Bangladesh. It is the 40th public university of Bangladesh and the first science and technology university in Mymensingh division.",
  "Tell me about Bangamata Sheikh Fojilatunnesa Mujib Science & Technology University": "Bangamata Sheikh Fojilatunnesa Mujib Science & Technology University is a government financed public university of Bangladesh. It is the 40th public university of Bangladesh and the first science and technology university in Mymensingh division.",
  "Tell me about CSE": "   \t The Department of Computer Science and Engineering, the first department of its kind, was established in 2019 under the Faculty of Engineering. From the very initial days of its establishment, it has been able to attract the very best students. Students securing topmost merit positions in the admission test of BSFMSTU opt for studies in this department. Currently, the Department has 1 PhDs, 4 MScs and designation-wise there are 3 Assistant Professors and 2 Lecturers.Since its inception in January 2019, CSE Department of BSFMSTU has already shown its remarkable progress towards becoming one of the best engineering Departments in the country to pursue undergraduate degree in Computer Science & Engineering (B.Sc. in CSE). The healthy relationship between the faculty and the students is a major strength for which CSE department of BSFMSTU stands clearly ahead of others. At present, the department offered only B.Sc. Engineering Degree in Computer Science and Engineering. Total 34 students are admitted each year for pursuing the B.Sc. Engineering degree.",
  "Who is the Registrar": "Syed Faruk Hossain is the registrar of bsfmstu.",
  "Who is the Vice Chancellor": "Professor Dr. Md. Kamrul Alam Khan is vice chancellor of bsfmstu .Professor Dr. Md. Kamrul Alam Khan is a prominent academic from Bangladesh and & world's top 2% scientists according to the AD Scientific Index 2022 data. He is the 2nd vice chancellor of Bangamata Sheikh Fojilatunnesa Mujib Science & Technology University (BSFMSTU). Prior to this position, he worked as a grade-1 professor of the Department of Physics at Jagannath University, Dhaka, Bangladesh and also served in different academic, administrative, and co-curricular development activities at Jagannath University as well as throughout the Bangladesh. He achieved 23 national and international awards for his great contribution in quality research and education including Best Innovation Award-2012, Tombarg Award for Environment Sustainability-2012 on Electricity Generation From Pathor Kuchi Leaf, presented by Texas University, Austin, USA.",
  "Who is the father of the nation": "The \"Father of the Nation\" in Bangladesh is Sheikh Mujibur Rahman, often affectionately referred to as \"Bangabandhu\" (which means \"Friend of Bengal\"). He played a pivotal role in the country's struggle for independence and is widely recognized as the founding leader of Bangladesh. Sheikh Mujibur Rahman served as the first President of Bangladesh and later as its Prime Minister. His leadership and vision were instrumental in the nation's emergence as an independent and sovereign state in 1971 following the Bangladesh Liberation War. Bangabandhu's contributions to the nation and his legacy continue to hold great significance in Bangladesh's history and politics.",
  "Who is the treasurer": "Mohammad Abdul Mannan is the Treasurer of bsfmstu.",
  "a poem": "Twinkle, twinkle, little star, How I wonder what you are! Up above the world so high, Like a diamond in the sky.",
  "bangamata": "Bangamata as named by the nation of Bangalees to Sheikh Fojilatunnesa Mujib wife of Bangabandhu Sheikh Mujibar Rahman, Father of the nation of Bangladesh was born on 08 August 1930 in the Village Tungipara of Gopalgong District. She has played a vital role in providing inspiration, enthusiasm and courage in all activities of Bangabandhu during his life time. She has contributed in every step of the independence of Bangladesh. She sent her two brave sons in the liberation war for the independence of the motherland. She sacrificed her life along with Bangabandhu and other family members on the black day of the history of Bangladesh, 15 August 1975.",
  "bangamata ": "Bangamata as named by the nation of Bangalees to Sheikh Fojilatunnesa Mujib wife of Bangabandhu Sheikh Mujibar Rahman, Father of the nation of Bangladesh was born on 08 August 1930 in the Village Tungipara of Gopalgong District. She has played a vital role in providing inspiration, enthusiasm and courage in all activities of Bangabandhu during his life time. She has contributed in every step of the independence of Bangladesh. She sent her two brave sons in the liberation war for the independence of the motherland. She sacrificed her life along with Bangabandhu and other family members on the black day of the history of Bangladesh, 15 August 1975.",
  "bongobondhu": "The \"Father of the Nation\" in Bangladesh is Sheikh Mujibur Rahman, often affectionately referred to as \"Bangabandhu\" (which means \"Friend of Bengal\"). He played a pivotal role in the country's struggle for independence and is widely recognized as the founding leader of Bangladesh. Sheikh Mujibur Rahman served as the first President of Bangladesh and later as its Prime Minister. His leadership and vision were instrumental in the nation's emergence as an independent and sovereign state in 1971 following the Bangladesh Liberation War. Bangabandhu's contributions to the nation and his legacy continue to hold great significance in Bangladesh's history and politics.",
  "current chairman of cse": "Md. Humaun Kabir,Assistant Professor is  the current chairman of cse department",
  "founding chairman of cse": "Dr. Mahmudul Alam, Assistant Professor is the founding chairman of cse department , bsfmstu",
  "how are you": "I am fine. Hope you are well.",
  "how many faculties in CSE": "There are five faculty in bsfmstu including Faculty of Engineering, Faculty of Science, Faculty of Agriculture & Life Science, Faculty of Business, Faculty of Social Science.",
  "is it worth it to study in cse bsfmstu?": "Currently, the Department has 1 PhDs, 4 MScs and designation-wise there are 3 Assistant Professors and 2 Lecturers.Since its inception in January 2019, CSE Department of BSFMSTU has already shown its remarkable progress towards becoming one of the best engineering Departments in the country to pursue undergraduate degree in Computer Science & Engineering (B.Sc. in CSE). The healthy relationship between the faculty and the students is a major strength for which CSE department of BSFMSTU stands clearly ahead of others.",
  "labs in cse": "Computer Science and Engineering (CSE) department has six laboratories for students and faculty members where they can perform experiments including Programming Lab,Software Engineering Lab,Networking Lab,Circuit Analysis Lab, Analog and Digital Electronics Lab, Communication Lab",
  "prime minister of Bangladesh": "Sheikh Hasina, Honourable Prime Minister of Government of the People’s Republic of Bangladesh, assumed the office on 07 January 2019 for the fourth time after her party Awami League-led grand alliance won the December 30, 2018 11th Parliamentary elections. She has overseen a period of economic growth and development in Bangladesh. She has also worked to improve education and healthcare in the country. She is a strong advocate for women's rights and has implemented a number of programs to empower women.",
  "study in cse": "Currently, the Department has 1 PhDs, 4 MScs and designation-wise there are 3 Assistant Professors and 2 Lecturers.Since its inception in January 2019, CSE Department of BSFMSTU has already shown its remarkable progress towards becoming one of the best engineering Departments in the country to pursue undergraduate degree in Computer Science & Engineering (B.Sc. in CSE). The healthy relationship between the faculty and the students is a major strength for which CSE department of BSFMSTU stands clearly ahead of others.",
  "transportation system": "Currently bsfmstu has 3 Bus for it's student and 3 Micro-bus for Teachers and Staffs",
  "your name": "My name is Elina but you must have known my name to ask me in the first place."
}
